Hi Guys,<br>
Welcome back to the pandas essentials, now we are going to talk about the missing data!<br>
## Handling Missing Data
Missing data is very common in many data analysis applications. pandas has a great ability to deal with the missing data. <br>Let's learn some convenient methods to deal with **missing data in pandas**:<br>

* isnull(), isna(), notnull(), dropna(), fillna(),

In [109]:
import numpy as np
import pandas as pd

Creating ad dataframe with missing data

In [110]:
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) # dataframe from a dic.

In [111]:
df

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN   NaN
2  NaN  13 NaN  18.0
3  4.0  14 NaN  19.0
4  NaN  15 NaN  20.0


**Check for missing data in the dataset!**

In [112]:
#code here

In [113]:
result = df.isna()
result

       M      N     O      P
0  False  False  True  False
1  False  False  True   True
2   True  False  True  False
3  False  False  True  False
4   True  False  True  False

In [114]:
#code here

In [115]:
missing_values_cnt = df.isnull().sum()
print(missing_values_cnt)

M    2
N    0
O    5
P    1
dtype: int64

In [116]:
#code here

In [117]:
total_miss = missing_values_cnt.sum()
total_miss

8

**fill the null value with N**

In [118]:
#code here

In [119]:
dummy_table = df.fillna('N')
dummy_table

     M   N  O     P
0  1.0  11  N  16.0
1  2.0  12  N     N
2    N  13  N  18.0
3  4.0  14  N  19.0
4    N  15  N  20.0

**fill the null values using mean of the column M.**

In [120]:
#code here

In [121]:
mean_A = df['M'].mean()
df['M'].fillna(mean_A, inplace=True)
df.M

C:\Users\subod\AppData\Local\Temp\ipykernel_5944\3937157968.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['M'].fillna(mean_A, inplace=True)

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: M, dtype: float64

In [122]:
df

          M   N   O     P
0  1.000000  11 NaN  16.0
1  2.000000  12 NaN   NaN
2  2.333333  13 NaN  18.0
3  4.000000  14 NaN  19.0
4  2.333333  15 NaN  20.0

Forward fill

In [123]:
#code here

In [124]:
df.fillna(method='ffill', inplace=True)
df

C:\Users\subod\AppData\Local\Temp\ipykernel_5944\3303779087.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', inplace=True)

          M   N   O     P
0  1.000000  11 NaN  16.0
1  2.000000  12 NaN  16.0
2  2.333333  13 NaN  18.0
3  4.000000  14 NaN  19.0
4  2.333333  15 NaN  20.0

**Make this dataframe using Dictionary**

In [125]:
#code here

In [126]:
new_data = {
    'key': ['a', 'b', 'c'],
    'A1': [0, 1, 2],
    'B1': [5, 6, 7],
    'A2': [0, 1, 2],
    'B2': [3, 4, 5]
}
new_df = pd.DataFrame(new_data)
print(new_df)

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5